{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "grooming",
    "1": "hate_or_threat",
    "2": "insult",
    "3": "normal",
    "4": "scam",
    "5": "sexual"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "grooming": 0,
    "hate_or_threat": 1,
    "insult": 2,
    "normal": 3,
    "scam": 4,
    "sexual": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
